=begin ************************************************************************
  Ÿ ‰ñ“]Ž®ƒoƒgƒ‹ƒRƒ}ƒ“ƒh Ver.1.11
  ---------------------------------------------------------------------------
    ƒoƒgƒ‹ƒRƒ}ƒ“ƒh‚ð‰ñ“]Ž®ƒAƒCƒRƒ“ƒRƒ}ƒ“ƒh‚É•ÏX‚µ‚Ü‚·B
=end # ************************************************************************

=begin Remove this line and the final =end to enable this script

#-information------------------------------------------------------------------
$ziifee ||= {}
$ziifee[:RollBattleCommand] = true
#------------------------------------------------------------------------------
#-memo-------------------------------------------------------------------------
#  [•K—vƒXƒNƒŠƒvƒg]
#    ‰æ‘œƒRƒ}ƒ“ƒhƒXƒNƒŠƒvƒg (Ver.1.50ˆÈã)
#  [•K—v‰æ‘œ] ˆÈ‰º‚Ì‰æ‘œ‚ð Graphics/System ‚ÉƒCƒ“ƒ|[ƒg‚µ‚Ä‚­‚¾‚³‚¢B
#    ƒoƒgƒ‹ƒRƒ}ƒ“ƒh—p”wŒi‰æ‘œ ( ƒtƒ@ƒCƒ‹–¼ : Ring96x88 )
# - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
#  ‚±‚ÌƒXƒNƒŠƒvƒg‚ÍA‰æ‘œƒRƒ}ƒ“ƒhƒXƒNƒŠƒvƒg‚Ì‰º‚É“ü‚ê‚Ä‚­‚¾‚³‚¢B
#  ƒAƒCƒRƒ“‚Ì•ÏX‚ÍA‰æ‘œƒRƒ}ƒ“ƒhƒXƒNƒŠƒvƒg‚Ì’†‚Ås‚¦‚Ü‚·B
#------------------------------------------------------------------------------

module ZiifRollBattleCommand
  # ¥ ƒRƒ}ƒ“ƒh•\Ž¦Œã‚É•\Ž¦ˆÊ’u‚ð’²®‚·‚é ( true / false )
  AdjustPartyWindow = true      # ƒp[ƒeƒBƒEƒBƒ“ƒhƒE
  AdjustActorWindow = true      # ƒAƒNƒ^[ƒEƒBƒ“ƒhƒE
end

#******************************************************************************
# ¥ ‰ñ“]Ž®ƒRƒ}ƒ“ƒh“±“ü•”
#******************************************************************************

class Window_PartyCommand; include ZiifSpriteCommand_RollIcon; end
class Window_ActorCommand; include ZiifSpriteCommand_RollIcon; end

#******************************************************************************
# ¥ ƒŒƒCƒAƒEƒg•”
#******************************************************************************

#==============================================================================
# ¡ Sprite_ZiifRollIconActorBattleCommand
#==============================================================================

class Sprite_ZiifRollIconActorBattleCommand < Sprite_ZiifRollIconCommand
  #--------------------------------------------------------------------------
  # œ ƒAƒCƒRƒ“”Ô†‚ÌŽæ“¾
  #--------------------------------------------------------------------------
  def icon_index
    if command_set.command_symbol(self.index) == :attack
      return command_set.attack_icon_index
    end
    return super
  end
end

#==============================================================================
# ¡ Window_PartyCommand
#==============================================================================

class Window_PartyCommand
  #--------------------------------------------------------------------------
  # œ •‚ÌŽæ“¾
  #--------------------------------------------------------------------------
  def window_width
    return 96
  end
  #--------------------------------------------------------------------------
  # œ ‚‚³‚ÌŽæ“¾
  #--------------------------------------------------------------------------
  def window_height
    return 88
  end
  #--------------------------------------------------------------------------
  # œ ”wŒi‰æ‘œ‚Ìƒtƒ@ƒCƒ‹–¼‚ðŽæ“¾
  #--------------------------------------------------------------------------
  def background_filename
    return "Ring96x88"
  end
end

#==============================================================================
# ¡ Window_ActorCommand
#==============================================================================

class Window_ActorCommand
  #--------------------------------------------------------------------------
  # œ •‚ÌŽæ“¾
  #--------------------------------------------------------------------------
  def window_width
    return 96
  end
  #--------------------------------------------------------------------------
  # œ ‚‚³‚ÌŽæ“¾
  #--------------------------------------------------------------------------
  def window_height
    return 88
  end
  #--------------------------------------------------------------------------
  # œ ”wŒi‰æ‘œ‚Ìƒtƒ@ƒCƒ‹–¼‚ðŽæ“¾
  #--------------------------------------------------------------------------
  def background_filename
    return "Ring96x88"
  end
  #--------------------------------------------------------------------------
  # œ ƒXƒvƒ‰ƒCƒgƒRƒ}ƒ“ƒhƒNƒ‰ƒX‚ÌŽæ“¾
  #--------------------------------------------------------------------------
  def sprite_command_class
    return Sprite_ZiifRollIconActorBattleCommand
  end
  #--------------------------------------------------------------------------
  # œ UŒ‚ƒAƒCƒRƒ“”Ô†‚ðŽæ“¾
  #--------------------------------------------------------------------------
  def attack_icon_index
    if @actor && !@actor.weapons.compact.empty?
      return @actor.weapons.compact.first.icon_index
    end
    ZiifManager::IconSet[:attack][nil]
  end
end

#==============================================================================
# ¡ Scene_Battle
#==============================================================================

class Scene_Battle
  #--------------------------------------------------------------------------
  # œ ƒp[ƒeƒBƒRƒ}ƒ“ƒhƒEƒBƒ“ƒhƒE‚Ìì¬
  #--------------------------------------------------------------------------
  alias :ziif_roll_battle_command_create_party_command_window :create_party_command_window
  def create_party_command_window
    ziif_roll_battle_command_create_party_command_window
    if ZiifRollBattleCommand::AdjustPartyWindow
      @party_command_window.x += 64
      @party_command_window.y += 60
    end
  end
  #--------------------------------------------------------------------------
  # œ ƒAƒNƒ^[ƒRƒ}ƒ“ƒhƒEƒBƒ“ƒhƒE‚Ìì¬
  #--------------------------------------------------------------------------
  alias :ziif_roll_battle_command_create_actor_command_window :create_actor_command_window
  def create_actor_command_window
    ziif_roll_battle_command_create_actor_command_window
    if ZiifRollBattleCommand::AdjustActorWindow
      @actor_command_window.x += 64
      @actor_command_window.y += 60
    end
  end
end
=end